# AddToCircuit Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSystem..::..AddToCircuit Method
ElectricalSystem Class See Also
---
Add a set of exist components to the Electrical System.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool AddToCircuit(
	ElementSet components
)
```

Visual Basic
---
```text
Public Function AddToCircuit ( _
	components As ElementSet _
) As Boolean
```

Visual C++
---
```text
public:
bool AddToCircuit(
	ElementSet^ components
)
```

# ### Parameters
components
    Type: Autodesk.Revit.DB..::..ElementSetThe components added to the electrical system.
# ### Return Value
If successful, all the components will add to the system. Otherwise nullNothingnullptra null reference (Nothing in Visual Basic) is returned.
# Remarks
This method will only function with the Autodesk Revit MEP application.
# See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace